sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
/******************************************************************************
 * Private Data
 *****************************************************************************/
bleCommMem commMem = {0};
bleGapWrapperBondInfo BondInfoInFlash[BLE_SAVE_BOND_DEVICE_MAX_NUM] = {{0}};
uint32_t bleBondEnableList = 0;
bleBondInfoKey bleKey = {0};
struct bt_common_context_s bt_common_context = {0};

#define BUF_LEN_MAX 32

#ifndef CONFIG_NRF51822
#define READ_BUFF_LEN 512
#else
#define READ_BUFF_LEN 20
#endif

#define WAIT_TIME (100*1000)
#define LOG_OUT printf
#define AUTH_KEY_SIZE   6

static struct ble_hal_common_ops_s ble_hal_common_ops =
{
  .setDevAddr           = nrf52_ble_set_dev_addr,
  .setDevName           = nrf52_ble_set_dev_name,
  .setAppearance        = nrf52_ble_set_appearance,
  .setPPCP              = nrf52_ble_set_ppcp,
  .advertise            = nrf52_ble_advertise,
  .scan                 = nrf52_ble_scan,
  .connect              = nrf52_ble_connect,
  .disconnect           = nrf52_ble_disconnect,
  .setMtuSize           = nrf52_ble_set_mtusize,
  .getMtuSize           = nrf52_ble_get_mtusize,
  .getNegotiatedMtuSize = nrf52_ble_get_negotiated_mtusize,
};

static struct bt_hal_common_ops_s bt_hal_common_ops =
{
  .init          = nrf52_bt_init,
  .finalize      = nrf52_bt_finalize,
  .enable        = nrf52_bt_enable,
  .setDevAddr    = NULL,
  .getDevAddr    = NULL,
  .setDevName    = NULL,
  .getDevName    = NULL,
  .paringEnable  = NULL,
  .getBondList   = NULL,
  .unBond        = NULL,
  .setVisibility = NULL,
  .inquiryStart  = NULL,
  .inquiryCancel = NULL
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int blePowerOff(void)
{
  int ret = 0;

//  for support reset pin. (Will be valid later)
//  board_nrf52_reset(true);
  ret = board_power_control(POWER_BTBLE, false);
  if (ret)
    {
      BLE_PRT("board_power_control(off): NG %d\n", ret);
      return ret;
    }
  BLE_PRT("Power off BLE!!\n");
  return BLE_SUCCESS;
}

static void bleInitBondInfoKey(void)
{
  bleKey.enable_key = BSO_GenerateRegistryKey(BOND_ENABLE_KEY_NAME, 0);
  bleKey.info_key[0] = BSO_GenerateRegistryKey(BOND_INFO_1_KEY_NAME, 0);
  bleKey.info_key[1] = BSO_GenerateRegistryKey(BOND_INFO_2_KEY_NAME, 0);
  bleKey.info_key[2] = BSO_GenerateRegistryKey(BOND_INFO_3_KEY_NAME, 0);
  bleKey.info_key[3] = BSO_GenerateRegistryKey(BOND_INFO_4_KEY_NAME, 0);
  bleKey.info_key[4] = BSO_GenerateRegistryKey(BOND_INFO_5_KEY_NAME, 0);
  bleKey.info_key[5] = BSO_GenerateRegistryKey(BOND_INFO_6_KEY_NAME, 0);
  bleKey.info_key[6] = BSO_GenerateRegistryKey(BOND_INFO_7_KEY_NAME, 0);
  bleKey.info_key[7] = BSO_GenerateRegistryKey(BOND_INFO_8_KEY_NAME, 0);
#ifdef BLE_DBGPRT_ENABLE
  BLE_PRT("bleInitBondInfoKey: enable_key 0x%lx\n", bleKey.enable_key);
  for (int i=0; i<BLE_SAVE_BOND_DEVICE_MAX_NUM; i++) {
    BLE_PRT("bleInitBondInfoKey: info_key[%d] 0x%lx\n", i, bleKey.info_key[i]);
  }
#endif
}

static void set_EncKey_for_save_event(struct ble_idkey_s *apps,
                                      ble_gap_enc_key_t  *nrf52)
{
  memcpy(apps->ltk, nrf52->enc_info.ltk, BLE_LTK_LEN);
  apps->ediv = nrf52->master_id.ediv;
  memcpy(apps->rand, nrf52->master_id.rand, BLE_RAND_LEN);
}

static void set_bondinfo_for_save_event(struct ble_bondinfo_s *apps,
                                        bleGapWrapperBondInfo *nrf52)
{
  static struct ble_cccd_s cccd;

  apps->peer_addr.type = nrf52->bondInfo.addrType;
  memcpy(apps->peer_addr.addr,
         nrf52->bondInfo.addr,
         BLE_GAP_ADDR_LENGTH);

  memcpy(nrf52->ownIdKey.id_info.irk, apps->own.irk, BLE_GAP_SEC_KEY_LEN);
  memcpy(nrf52->peerIdKey.id_info.irk, apps->peer.irk, BLE_GAP_SEC_KEY_LEN);
  set_EncKey_for_save_event(&apps->own,  &nrf52->ownEncKey);
  set_EncKey_for_save_event(&apps->peer, &nrf52->peerEncKey);

  apps->cccd_num = 1;
  apps->cccd = &cccd;
  memcpy(&cccd.handle,
         &nrf52->sys_attr_data[NRF52_SYS_ATTR_DATA_OFFSET_HANDLE],
         NRF52_SYS_ATTR_DATA_LEN_HANDLE);
  memcpy(&cccd.value,
         &nrf52->sys_attr_data[NRF52_SYS_ATTR_DATA_OFFSET_VALUE],
         NRF52_SYS_ATTR_DATA_LEN_VALUE);
}

static void mk_save_bondinfo_event(void)
{
  int i;
  static struct ble_bondinfo_s bond[BLE_SAVE_BOND_DEVICE_MAX_NUM];
  struct ble_event_bondinfo_t evt;

  evt.group_id = BLE_GROUP_COMMON;
  evt.event_id = BLE_COMMON_EVENT_SAVE_BOND;
  evt.num = 0;

  for (i = 0; i < BLE_SAVE_BOND_DEVICE_MAX_NUM; i++)
    {
      if (((bleBondEnableList >> i) & 1) == 1)
        {
          set_bondinfo_for_save_event(&bond[evt.num],
                                      &BondInfoInFlash[i]);
          evt.num++;
        }
    }

  evt.bond = bond;

  ble_common_event_handler((struct bt_event_t *) &evt);
}

static int mk_load_bondinfo_event(struct ble_bondinfo_s *bond)
{
  struct ble_event_bondinfo_t evt;

  evt.group_id = BLE_GROUP_COMMON;
  evt.event_id = BLE_COMMON_EVENT_LOAD_BOND;
  evt.num = BLE_SAVE_BOND_DEVICE_MAX_NUM;
  evt.bond = bond;

  return ble_common_event_handler((struct bt_event_t *) &evt);
}

static void save_EncKey(ble_gap_enc_key_t  *nrf52,
                        struct ble_idkey_s *apps)
{
  memcpy(nrf52->enc_info.ltk, apps->ltk, BLE_GAP_SEC_KEY_LEN);
  nrf52->enc_info.ltk_len = BLE_GAP_SEC_KEY_LEN;
  nrf52->master_id.ediv = apps->ediv;
  memcpy(nrf52->master_id.rand, apps->rand, BLE_GAP_SEC_RAND_LEN);
}

static void save_cccd(int num,
                      struct ble_cccd_s *cccd,
                      uint8_t *sys_attr_data)
{
  int i;
  uint16_t *p = (uint16_t *)sys_attr_data;

  for (i = 0; i < num; i++)
    {
      *p++ = cccd[i].handle;
      *p++ = sizeof(cccd[i].value);
      *p++ = cccd[i].value;
    }

  /* Append CRC16 value for created sys_attr_data. */

  *p = crc16part(sys_attr_data, (uint8_t *)p - sys_attr_data, 0xFFFF);
}

static void save_apps_bondinfo(int num,
                               struct ble_bondinfo_s *apps_bond,
                               uint32_t *enable_list,
                               bleGapWrapperBondInfo *bond)
{
  int i;
  struct ble_bondinfo_s *apps = &apps_bond[0];
  bleGapWrapperBondInfo *nrf52 = &bond[0];

  *enable_list = 0;

  for (i = 0, apps = &apps_bond[0], nrf52 = &bond[0];
       i < num;
       i++, apps++, nrf52++)
    {
      *enable_list |= (1 << i);
      nrf52->bondInfo.addrType = apps->peer_addr.type;
      memcpy(nrf52->bondInfo.addr,
             apps->peer_addr.addr,
             BLE_GAP_ADDR_LENGTH);
      memcpy(nrf52->ownIdKey.id_info.irk, apps->own.irk, BLE_GAP_SEC_KEY_LEN);
      memcpy(nrf52->peerIdKey.id_info.irk, apps->peer.irk, BLE_GAP_SEC_KEY_LEN);
      nrf52->peerIdKey.id_addr_info.addr_id_peer = 1;
      nrf52->peerIdKey.id_addr_info.addr_type = apps->peer_addr.type;
      memcpy(nrf52->peerIdKey.id_addr_info.addr,
             apps->peer_addr.addr,
             BLE_GAP_ADDR_LENGTH);
      save_EncKey(&nrf52->ownEncKey,  &apps->own);
      save_EncKey(&nrf52->peerEncKey, &apps->peer);
      save_cccd(apps->cccd_num, apps->cccd, nrf52->sys_attr_data);
    }
}

