sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
static void load_apps_bondinfo(uint32_t *enable_list,
                               bleGapWrapperBondInfo *bond)
{
  int num;
  static struct ble_bondinfo_s apps_bond[BLE_SAVE_BOND_DEVICE_MAX_NUM];

  num = mk_load_bondinfo_event(apps_bond);
  save_apps_bondinfo(num, apps_bond, enable_list, bond);
}

static int bleGetBondInfo(void)
{
  bleInitBondInfoKey();
  load_apps_bondinfo(&bleBondEnableList, BondInfoInFlash);

  return 0;
}

int BLE_CommonInitializeStack(BLE_InitializeParams *initializeParams)
{
  uint8_t role = 0;
  int ret = BLE_SUCCESS;

  if (initializeParams == NULL)
    {
      return -EINVAL;
    }
  if (commMem.stackInited)
    {
      return -EPERM;
    }

//  for pin configuration. (Will be valid later)
//  board_nrf52_initialize();

  commMem.gapMem = bleGetGapMem();
  role = initializeParams->role;
  ret = BSO_Init(NULL);
  if (ret)
    {
      BLE_PRT("BSO_Init failed\n");
      return ret;
    }
  ret = bleGetBondInfo();
  if (ret)
    {
      BLE_PRT("bleGetBondInfo: NG %d\n", ret);
      return ret;
    }
  switch (role)
    {
      case BLE_ROLE_PERIPHERAL:
      case BLE_ROLE_CENTRAL:
      case BLE_ROLE_PERIPHERAL_AND_CENTRAL:
        ret = blePowerOn();
        if (ret)
          {
            goto errPower;
          }
        ret = bleStackInit();
        if (ret)
          {
            BLE_PRT("bleStackInit: NG %d\n", ret);
            goto errInit;
          }
        else
          {
            commMem.stackInited = true;
          }

        commMem.requested_mtu = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
        commMem.client_rx_mtu = BLE_GATT_ATT_MTU_DEFAULT;
        break;

      default:
        ret = -EINVAL;
        break;
    }
  return ret;
errInit:
  bleStackFin();
  blePowerOff();
errPower:
  return ret;

}

int BLE_CommonSetBleEvtCallback(BLE_EfCb funcCb, BLE_EvtCtx *ctx)
{
  if (ctx == NULL)
    {
      return -EINVAL;
    }
  if (commMem.managerCbFlag)
    {
      return -EPERM;
    }

  commMem.cbId = funcCb;
  commMem.bleEvtCtx = ctx;
  commMem.callbackFlag = 1;
  BLE_PRT("%s:commMem.callbackFlag=%d\n", __func__, commMem.callbackFlag);
  return BLE_SUCCESS;
}

int BLE_CommonFinalizeStack(void)
{
  int ret = BLE_SUCCESS;
  if (!commMem.stackInited)
    {
      return ret;
    }
  commMem.callbackFlag = 0;
  commMem.gapMem = NULL;
  if (bleStackFin())
    {
      ret = -EPERM;
    }
  if (blePowerOff())
    {
      ret = -EPERM;
    }
  commMem.stackInited = false;
  return ret;
}

static
int blePowerOn(void)
{
  int ret = 0;
  ret = board_power_control(POWER_BTBLE, true);
  if (ret)
    {
      BLE_PRT("board_power_control(on): NG %d\n", ret);
      goto errPower;
    }
//  for support reset pin. (Will be valid later)
//  board_nrf52_reset(false);
  BLE_PRT("Power on BLE!!\n");
  return BLE_SUCCESS;
errPower:
  (void)board_power_control(POWER_BTBLE, false);
  return ret;

}

int bleConvertErrorCode(uint32_t errCode)
{
  int ret = 0;
  switch (errCode)
    {
      case NRF_SUCCESS:
        ret = BLE_SUCCESS;
        break;
      case NRF_ERROR_INVALID_PARAM:
        BLE_ERR("errno: 0x%lx, Invalid parameter.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_STATE:
        BLE_ERR("errno: 0x%lx, Invalid state.\n", errCode);
        ret = -EPERM;
        break;
      case NRF_ERROR_INVALID_ADDR:
        BLE_ERR("errno: 0x%lx, Bad Memory Address.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_FLAGS:
        BLE_ERR("errno: 0x%lx, Invalid flags.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_DATA:
        BLE_ERR("errno: 0x%lx, Invalid data.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_DATA_SIZE:
        BLE_ERR("errno: 0x%lx, Data size exceeds limit.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_LENGTH:
        BLE_ERR("errno: 0x%lx, Invalid length.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_NOT_SUPPORTED:
        BLE_ERR("errno: 0x%lx, Not supported.\n", errCode);
        ret = -ENOTSUP;
        break;
      case NRF_ERROR_BUSY:
        BLE_ERR("errno: 0x%lx, Busy.\n", errCode);
        ret = -EBUSY;
        break;
      case NRF_ERROR_NO_MEM:
        BLE_ERR("errno: 0x%lx, No Memory for operation.\n", errCode);
        ret = -ENOMEM;
        break;
      case NRF_ERROR_FORBIDDEN:
        BLE_ERR("errno: 0x%lx, Forbidden Operation.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_INVALID_CONN_HANDLE:
        BLE_ERR("errno: 0x%lx, Invalid connection handler.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_GAP_UUID_LIST_MISMATCH:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_UUID_LIST_MISMATCH.\n", errCode);
        ret = -EINVAL;
        break;
      case BLE_ERROR_GAP_INVALID_BLE_ADDR:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_INVALID_BLE_ADDR.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_GAP_WHITELIST_IN_USE:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_WHITELIST_IN_USE.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_GAP_DISCOVERABLE_WITH_WHITELIST:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_DISCOVERABLE_WITH_WHITELIST.\n", errCode);
        ret = -EPERM;
        break;
      case NRF_ERROR_TIMEOUT:
        BLE_ERR("errno: 0x%lx, NRF_ERROR_TIMEOUT.\n", errCode);
        ret = -ETIMEDOUT;
        break;
      default:
        if (errCode > 0)
          {
            BLE_ERR("errno: 0x%lx, Stack error.\n", errCode);
            ret = -EPERM;
          }
        break;
    }
  return ret;
}

static
int bleStackInit(void)
{
  int ret;
  BLE_PRT("nrf_sdh_enable_request\n");
  ret = nrf_sdh_enable_request();
  if (ret)
    {
      return bleConvertErrorCode(ret);
    }
  // Configure the BLE stack using the default settings.
  // Fetch the start address of the application RAM.
  BLE_PRT("nrf_sdh_ble_default_cfg_set\n");
  ret = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, NULL);
  if (ret)
    {
      goto err;
    }
  // Enable BLE stack.
  BLE_PRT("nrf_sdh_ble_enable\n");
  ret = nrf_sdh_ble_enable(NULL);
  if (ret)
    {
      goto err;
    }
  // Register a handler for BLE events.
#ifdef BLE_USE_SECTION
  BLE_PRT("NRF_SDH_BLE_OBSERVER\n");
  NRF_SDH_BLE_OBSERVER(m_ble_observer, 0, (void *)bleEvtDispatch, NULL);
#endif
  return ret;
err:
  nrf_sdh_disable_request();
  return bleConvertErrorCode(ret);
}

static
int bleStackFin(void)
{
  int ret = 0;
  ret = nrf_sdh_disable_request();
  return bleConvertErrorCode(ret);
}

