sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
void bleNrfEvtHandler(BLE_Evt *bleEvent, ble_evt_t *pBleNrfEvt)
{
  BLE_PRT("bleNrfEvtHandler 0x%x\n", pBleNrfEvt->header.evt_id);
  memset(bleEvent, 0x00, sizeof(BLE_Evt));
  switch(pBleNrfEvt->header.evt_id)
    {
      case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE:
      case BLE_GATTS_EVT_HVN_TX_COMPLETE:
        onTxComplete(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONNECTED:
        onConnect(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        onConnParamUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        onConnParamUpdateRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_DISCONNECTED:
        onDisconnect(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        onSecParamsRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_AUTH_STATUS:
        onAuthStatus(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_PASSKEY_DISPLAY:
        onDispPasskey(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_ADV_REPORT:
        onAdvReport(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_AUTH_KEY_REQUEST:
        onAuthKeyRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_SEC_INFO_REQUEST:
        onSecInfoRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_RSSI_CHANGED:
        onRssiChanged(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_WRITE:
        onGattsWrite(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_HVC:
        onGattsIndConfirm(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONN_SEC_UPDATE:
        onConnSecUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_TIMEOUT:
        onTimeout(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        onDataLengthUpdateRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
        onDataLengthUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_SCAN_REQ_REPORT:
        onScanReqReport(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        onPhyUpdateReq(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_PHY_UPDATE:
        onPhyUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
        onPrimarySrvDiscoveryRsp(&commMem.gattcDb, bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_CHAR_DISC_RSP:
        onCharacteristicDiscoveryRsp(&commMem.gattcDb, bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_DESC_DISC_RSP:
        onDescriptorDiscoveryRsp(&commMem.gattcDb, bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_READ_RSP:
        onReadRsp(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_WRITE_RSP:
        onWriteRsp(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_HVX:
        onHvx(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
        onExchangeMtuResponse(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        onSysAttrMissing(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_TIMEOUT:
        onGattsTimeout(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        onExchangeMtuRequest(bleEvent, pBleNrfEvt);
        break;
    #if NRF_SD_BLE_API_VERSION > 5
      case BLE_GAP_EVT_ADV_SET_TERMINATED:
        onAdvSetTerminate(bleEvent, pBleNrfEvt);
        break;
    #endif
      default:
        bleEvent->evtHeader = (BLE_EventTypes)pBleNrfEvt->header.evt_id;
        BLE_ERR("Unknown event 0x%x\n", bleEvent->evtHeader);
        break;
      }
}

static void ble_advertise(int mode)
{
  int ret = 0;

  if (mode == 2)
    {
      LOG_OUT("ble_peripheral: Long range\n");
      BLE_GapAdvParams p = {0x40, 0, BLE_GAP_PHY_CODED, 0};
      ret = BLE_GapStartAdvExt(&p);

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble enable advertise failed, ret=%d\n", ret);
        }
    }
  else if (mode == 1)
    {
      ret = BLE_GapStartAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble enable advertise failed, ret=%d\n", ret);
        }
    }
  else
    {
      ret = BLE_GapStopAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble disable advertise failed, ret=%d\n", ret);
        }
    }
}

static void on_connected(const BLE_EvtConnected* evt)
{
  LOG_OUT("Connected: handle %d, role %d\n", evt->handle, evt->role);
  g_ble_context.ble_srv_sds.conn_handle = evt->handle;
  g_ble_context.ble_conn_handle         = evt->handle;
  g_ble_context.ble_role                = evt->role;

  struct ble_event_conn_stat_t conn_stat_evt;
  conn_stat_evt.connected = true;
  conn_stat_evt.handle = evt->handle;
  memcpy(conn_stat_evt.addr.address, evt->addr.addr, BT_ADDR_LEN);
  conn_stat_evt.group_id = BLE_GROUP_COMMON;
  conn_stat_evt.event_id = BLE_COMMON_EVENT_CONN_STAT_CHANGE;
  ble_common_event_handler((struct bt_event_t *) &conn_stat_evt);

  if ((evt->role == BLE_ROLE_CENTRAL) &&
      (commMem.requested_mtu != BLE_GATT_ATT_MTU_DEFAULT))
    {
      sd_ble_gattc_exchange_mtu_request(evt->handle, commMem.requested_mtu);
    }
}

static void on_disconnected(const BLE_EvtDisconnected* evt)
{
  LOG_OUT("Disconnected: HCI status 0x%x\n", evt->reason);
  g_ble_context.ble_conn_handle = CONN_HANDLE_INVALED;
  struct ble_event_conn_stat_t conn_stat_evt;

  conn_stat_evt.connected = false;

  conn_stat_evt.group_id = BLE_GROUP_COMMON;
  conn_stat_evt.event_id = BLE_COMMON_EVENT_CONN_STAT_CHANGE;

  ble_common_event_handler((struct bt_event_t *) &conn_stat_evt);
  if (g_ble_context.ble_role == BLE_ROLE_PERIPHERAL)
    {
      int ret;
      g_ble_context.ble_srv_sds.notify_enabled = 0;
      LOG_OUT("Advertising restart !!\n");
      ret = BLE_GapStartAdv();
      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("BLE_GapStartAdv failed, ret=%d\n", ret);
        }
    }
}

static void on_read_rsp(BLE_EvtGattcRead *readRsp)
{
  struct ble_gatt_event_read_rsp_t evt;

  evt.group_id    = BLE_GROUP_GATT;
  evt.event_id    = BLE_GATT_EVENT_READ_RESP;
  evt.conn_handle = readRsp->connHandle;
  evt.char_handle = readRsp->charValHandle;
  evt.length      = readRsp->charValLen;
  memcpy(evt.data, readRsp->charValData, sizeof(evt.data));

  ble_gatt_event_handler((struct bt_event_t *)&evt);
}

