sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
static void on_exchange_feature(const BLE_EvtExchangeFeature* exchange_feature)
{
  BLE_GapPairingFeature* pf = &g_ble_context.pairing_feature;
  int ret = BLE_GapExchangePairingFeature(exchange_feature->handle, pf);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("exchange pairing feature failed, ret=%d\n", ret);
    }
  else
    {
      LOG_OUT("exchange pairing feature success\n");
    }
}

static void on_rssi_changed(const BLE_EvtRssiChanged* evt)
{
  LOG_OUT("[BLE][LOG]RSSI changed, value: %d\n", evt->rssi);
}

static void on_disp_passkey(BLE_EvtDisplayPasskey* disp_passkey)
{
  LOG_OUT("[BLE][LOG]Passkey: %s\n", disp_passkey->passkey);
}

static void on_auth_status(BLE_EvtAuthStatus* auth_status)
{
  int ret   = BLE_SUCCESS;
  int index = 0;
  BLE_GapBondInfoList bond_id = {0};
  if (auth_status->status != BLE_GAP_SM_STATUS_SUCCESS)
    {
      LOG_OUT("[BLE][LOG]Pairing failed! ErrCode: %x\n", auth_status->status);
      return;
    }
  else
    {
      LOG_OUT("[BLE][LOG]Pairing success!\n");
    }
  LOG_OUT("[BLE][LOG]save bond address:%02X:%02X:%02X:%02X:%02X:%02X\n",\
      auth_status->bondInfo.addr[5],\
      auth_status->bondInfo.addr[4],\
      auth_status->bondInfo.addr[3],\
      auth_status->bondInfo.addr[2],\
      auth_status->bondInfo.addr[1],\
      auth_status->bondInfo.addr[0]);
  ret = BLE_GapSaveBondInfo(&auth_status->bondInfo);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GapSaveBondInfo\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GapSaveBondInfo\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }

  ret = BLE_GapGetBondInfoIdList(&bond_id);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GapGetBondInfoIdList\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GapGetBondInfoIdList\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }

  LOG_OUT("[BLE][LOG]bond_id.bondNum = %ld\n", bond_id.bondNum);

  for(index=0; index<bond_id.bondNum; index++)
    {
      LOG_OUT("[BLE][LOG]Address[%d]:%02X:%02X:%02X:%02X:%02X:%02X\n",\
          index,\
          bond_id.bondInfoId[index][5],\
          bond_id.bondInfoId[index][4],\
          bond_id.bondInfoId[index][3],\
          bond_id.bondInfoId[index][2],\
          bond_id.bondInfoId[index][1],\
          bond_id.bondInfoId[index][0]);
    }

  mk_save_bondinfo_event();
}

static void on_timeout(BLE_EvtTimeout *timeout)
{
  int ret = BLE_SUCCESS;
  switch(timeout->timeoutSrc)
    {
      case BLE_GAP_TIMEOUT_ADVERTISING:
        LOG_OUT("[BLE][LOG]Timeout reason: Advertising timeout!\n");
        LOG_OUT("[BLE][LOG]Start advertise\n");
        ble_advertise(1);
        break;
      case BLE_GAP_TIMEOUT_SECURITY_REQUEST:
        LOG_OUT("[BLE][LOG]Timeout reason: Security request timeout!\n");
        break;
      case BLE_GAP_TIMEOUT_SCAN:
        LOG_OUT("[BLE][LOG]Timeout reason: Scanning timeout!\n");
        ret = BLE_GapStartScan();
        if (BLE_SUCCESS == ret)
          {
            LOG_OUT("[BLE][SUCCESS]BLE_GapStartScan\n");
          }
        else
          {
            LOG_OUT("[BLE][ERROR]BLE_GapStartScan\n");
            LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
          }
        break;
      case BLE_GAP_TIMEOUT_CONN:
        LOG_OUT("[BLE][LOG]Timeout reason: Connection timeout!\n");
        break;
      default:
        LOG_OUT("[BLE][LOG]Timeout reason: Error\n");
        break;
    }
}

static int input_passkey(uint8_t *key)
{
  LOG_OUT("Please enter passkey:\n");
  const char* name = "passkey_input";
  int len = 0;

  LOG_OUT("%s> ", name);
  fflush(stdout);
  len = readline((char*)key, AUTH_KEY_SIZE, stdin, stdout);
  if (len < 1)
    {
      LOG_OUT("readpasskey error, ret:%d\n", len);
      return -1;
    }
  key[AUTH_KEY_SIZE] = '\0';
  LOG_OUT("passkey = %s", key);
  return BLE_SUCCESS;
}

static void on_auth_key_request(BLE_EvtAuthKey *auth_key)
{
  int ret = BLE_SUCCESS;
  uint8_t key[AUTH_KEY_SIZE + 1] = {0};
  BLE_GapAuthKey key_data = {0};

  if (BLE_GAP_AUTH_KEY_TYPE_PASSKEY != auth_key->keyType)
    {
      LOG_OUT("[BLE][LOG]Authentication key type is not BLE_GAP_AUTH_KEY_TYPE_PASSKEY!!!\n");
      LOG_OUT("[BLE][LOG]Key type number = %d\n", auth_key->keyType);
      return;
    }
  ret = input_passkey((uint8_t*)key);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]input_passkey\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]input_passkey\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }

  key_data.handle  = auth_key->handle;
  key_data.keyType = BLE_GAP_AUTH_KEY_TYPE_PASSKEY;
  key_data.keyLen  = AUTH_KEY_SIZE;
  key_data.key = key;
  ret = BLE_GapReplyAuthKey(&key_data);

  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GapReplyAuthKey\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GapReplyAuthKey\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }
}

static void on_conn_params_update(BLE_EvtConnParamUpdate* param)
{
  LOG_OUT("[BLE][LOG]Connection parameters updated\n");
  LOG_OUT("[BLE][LOG]Status: %d\n", param->status);
  LOG_OUT("[BLE][LOG]Minimum interval: %d\n", param->connParams.minConnInterval);
  LOG_OUT("[BLE][LOG]Maximum interval: %d\n", param->connParams.maxConnInterval);
  LOG_OUT("[BLE][LOG]Latency: %d\n", param->connParams.slaveLatency);
  LOG_OUT("[BLE][LOG]Timeout: %d\n", param->connParams.connSupTimeout);
}

typedef struct
{
  uint8_t *data;
  uint16_t data_len;
} data_t;

static int adv_report_parse(uint8_t type, data_t *adv_data, data_t *type_data)
{
  uint16_t index = 0;
  uint8_t *data = adv_data->data;

  while (index < adv_data->data_len)
    {
      uint8_t field_length = data[index];
      uint8_t field_type   = data[index+1];

      if (field_type == type)
        {
          type_data->data   = &data[index+2];
          type_data->data_len = field_length-1;
          type_data->data[type_data->data_len] = '\0';
          return 0;
        }

      index += field_length + 1;
    }

  return -1;
}

static void on_adv_report(BLE_EvtAdvReportData *adv_report)
{
  data_t advReport = {adv_report->data, adv_report->dlen};
  data_t localName;
  uint8_t localNameData[32] = {0};
  struct ble_event_adv_rept_t evt;
  int ret;

