sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  localName.data = localNameData;
  localName.data_len = 0;

  ret = adv_report_parse(0x09 /* COMPLETE_LOCAL_NAME */, &advReport, &localName);

  /* Current BT-BLE MW callback interface can notify only device name.
   * So, not notify if advertising data does not include device name.
   */

  if (ret == 0)
    {
      evt.group_id = BLE_GROUP_COMMON;
      evt.event_id = BLE_COMMON_EVENT_SCAN_RESULT;
      evt.rssi = adv_report->rssi;
      evt.scan_rsp = adv_report->scan_rsp;
      evt.length = localName.data_len;
      strncpy((char *)evt.data, (char *)localName.data, evt.length + 1);
      memcpy(evt.addr.address, adv_report->addr.addr, BLE_GAP_ADDR_LENGTH);
      ble_common_event_handler((struct bt_event_t *)&evt);
    }
}

static void on_phy_update_request(BLE_EvtPhyUpdate *phy_update)
{
  LOG_OUT("PHY update request: txPhy 0x%x, rxPhy 0x%x\n",
    phy_update->txPhy, phy_update->rxPhy);

  BLE_GapPhys phy = {phy_update->txPhy, phy_update->rxPhy};
  int ret = BLE_GapPhyUpdate(g_ble_context.ble_conn_handle, &phy);
  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("BLE_GapPhyUpdate failed, ret=%d\n", ret);
    }
}

static void on_phy_update(BLE_EvtPhyUpdate *phy_update)
{
  LOG_OUT("PHY updated: txPhy 0x%x, rxPhy 0x%x\n",
    phy_update->txPhy, phy_update->rxPhy);
}

static void on_data_len_update(BLE_EvtDataLengthUpdate *data_len)
{
  LOG_OUT("Data length updated: maxTx %d, maxRx %d, maxTxTime %d ms, maxRxTime %d ms\n",
    data_len->maxTx, data_len->maxRx, data_len->maxTxTime, data_len->maxRxTime);
}

static
void bleCommEvtDispatch(ble_evt_t *pBleNrfEvt)
{
  BLE_Evt *bleEvent = &commMem.bleEvtCtx->evt;
  bleNrfEvtHandler(bleEvent, pBleNrfEvt);
}

#ifdef BLE_USE_SECTION
static
#endif
void bleEvtDispatch(ble_evt_t *pBleNrfEvt)
{
  BLE_PRT("bleEvtDispatch callbackFlag %d managerCbFlag %d\n",
    commMem.callbackFlag, commMem.managerCbFlag);
  if (commMem.callbackFlag)
    {
      bleCommEvtDispatch(pBleNrfEvt);
    }
  if (commMem.managerCbFlag)
    {
      commMem.managerCb(pBleNrfEvt);
    }
}

#if NRF_SD_BLE_API_VERSION > 5
static
void onAdvSetTerminate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
#ifdef BLE_DBGPRT_ENABLE
  ble_gap_evt_adv_set_terminated_t *set = &pBleNrfEvt->evt.gap_evt.params.adv_set_terminated;
  BLE_PRT("onAdvSetTerminate reason=%d handle=%d num=%d\n",
    set->reason, set->adv_handle, set->num_completed_adv_events);
#endif
  pBleNrfEvt->evt.gap_evt.params.timeout.src = BLE_GAP_TIMEOUT_ADVERTISING;
  onTimeout(pBleEvent, pBleNrfEvt);
}
#endif

static
void onScanReqReport(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  BLE_PRT("onScanReqReort\n");
}

static
void onPhyUpdateReq(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_PHY_UPDATE_REQUEST;
  ble_gap_phys_t *phys = &pBleNrfEvt->evt.gap_evt.params.phy_update_request.peer_preferred_phys;
  BLE_PRT("onPhyUpdateReq tx_phy %d rx_phy %d\n", phys->tx_phys, phys->rx_phys);
  commMem.phyUpdate.txPhy = phys->tx_phys;
  commMem.phyUpdate.rxPhy = phys->rx_phys;
  commMem.phyUpdate.status = 0;
  pBleEvent->evtDataSize = sizeof(BLE_EvtPhyUpdate);
  memcpy(pBleEvent->evtData, &commMem.phyUpdate, pBleEvent->evtDataSize);

  on_phy_update_request((BLE_EvtPhyUpdate *)pBleEvent->evtData);
}

static
void onPhyUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_PHY_UPDATE;
  ble_gap_evt_phy_update_t *phys = &pBleNrfEvt->evt.gap_evt.params.phy_update;
  BLE_PRT("onPhyUpdate stat %d tx_phy %d rx_phy %d\n", phys->status, phys->tx_phy, phys->rx_phy);
  commMem.phyUpdate.txPhy = phys->tx_phy;
  commMem.phyUpdate.rxPhy = phys->rx_phy;
  commMem.phyUpdate.status = phys->status;
  pBleEvent->evtDataSize = sizeof(BLE_EvtPhyUpdate);
  memcpy(pBleEvent->evtData, &commMem.phyUpdate, pBleEvent->evtDataSize);

  on_phy_update((BLE_EvtPhyUpdate *)pBleEvent->evtData);
}

static
void onDataLengthUpdateRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int ret = 0;
#ifdef BLE_DBGPRT_ENABLE
  ble_gap_data_length_params_t *req = &pBleNrfEvt->evt.gap_evt.params.data_length_update_request.peer_params;
  BLE_PRT("onLenUpReq: max_tx=%d\n", req->max_tx_octets);
  BLE_PRT("onLenUpReq: max_rx=%d\n", req->max_rx_octets);
  BLE_PRT("onLenUpReq: tx_time=%d\n", req->max_tx_time_us);
  BLE_PRT("onLenUpReq: rx_time=%d\n", req->max_rx_time_us);
#endif
  ret = sd_ble_gap_data_length_update(pBleNrfEvt->evt.gap_evt.conn_handle, NULL, NULL);
  if (ret)
    {
      BLE_ERR("onLenUp: sd_ble_gap_data_length_update %d\n", ret);
    }
}

static
void onDataLengthUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_DATA_LENGTH_UPDATE;
  ble_gap_data_length_params_t *datalen = &pBleNrfEvt->evt.gap_evt.params.data_length_update.effective_params;
  BLE_PRT("onLenUp: max_tx=%d\n", datalen->max_tx_octets);
  BLE_PRT("onLenUp: max_rx=%d\n", datalen->max_rx_octets);
  BLE_PRT("onLenUp: tx_time=%d\n", datalen->max_tx_time_us);
  BLE_PRT("onLenUp: rx_time=%d\n", datalen->max_rx_time_us);
  commMem.dataLen = *(BLE_EvtDataLengthUpdate *)datalen;
  pBleEvent->evtDataSize = sizeof(BLE_EvtDataLengthUpdate);
  memcpy(pBleEvent->evtData, &commMem.dataLen, pBleEvent->evtDataSize);

  on_data_len_update((BLE_EvtDataLengthUpdate *)pBleEvent->evtData);
}

static void mk_mtusize_event(uint16_t handle, uint16_t sz)
{
  struct ble_event_mtusize_t evt;

  evt.mtusize  = sz;
  evt.handle   = handle;
  evt.group_id = BLE_GROUP_COMMON;
  evt.event_id = BLE_COMMON_EVENT_MTUSIZE;

  ble_common_event_handler((struct bt_event_t *) &evt);
}

static
void onExchangeMtuResponse(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  ble_gattc_evt_exchange_mtu_rsp_t *rsp;

  rsp = &pBleNrfEvt->evt.gattc_evt.params.exchange_mtu_rsp;
  BLE_PRT("onMtuReq: mtu=%d\n", req->client_rx_mtu);
  if (commMem.requested_mtu > rsp->server_rx_mtu)
    {
      commMem.client_rx_mtu = rsp->server_rx_mtu;
    }
  else
    {
      commMem.client_rx_mtu = commMem.requested_mtu;
    }

  mk_mtusize_event(pBleNrfEvt->evt.gattc_evt.conn_handle, commMem.client_rx_mtu);
}

static
void onExchangeMtuRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int ret = 0;
  ble_gatts_evt_exchange_mtu_request_t *req;

  req = &pBleNrfEvt->evt.gatts_evt.params.exchange_mtu_request;
  BLE_PRT("onMtuReq: mtu=%d\n", req->client_rx_mtu);
  if (commMem.requested_mtu > req->client_rx_mtu)
    {
      commMem.client_rx_mtu = req->client_rx_mtu;
    }
  else
    {
      commMem.client_rx_mtu = commMem.requested_mtu;
    }

  ret = sd_ble_gatts_exchange_mtu_reply(pBleNrfEvt->evt.gatts_evt.conn_handle,
                                        commMem.client_rx_mtu);
  if (ret)
    {
      BLE_ERR("onLenUp: sd_ble_gatts_exchange_mtu_reply %d\n", ret);
    }

  pBleEvent->evtHeader = BLE_GATTS_EVENT_EXCHANGE_MTU;
  commMem.gattsExchangeMTU.connHandle = pBleNrfEvt->evt.gatts_evt.conn_handle;
  commMem.gattsExchangeMTU.client_rx_mtu = req->client_rx_mtu;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattsExchangeMTU);
  memcpy(pBleEvent->evtData, &commMem.gattsExchangeMTU, pBleEvent->evtDataSize);

