sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  mk_mtusize_event(pBleNrfEvt->evt.gatts_evt.conn_handle, commMem.client_rx_mtu);
}

static
void onTxComplete(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_EVENT_TX_COMPLETE;
  if (pBleNrfEvt->header.evt_id == BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE)
    {
      commMem.txCompleteData.connHandle = pBleNrfEvt->evt.gattc_evt.conn_handle;
      commMem.txCompleteData.count = pBleNrfEvt->evt.gattc_evt.params.write_cmd_tx_complete.count;
      commMem.txCompleteData.role = BLE_ROLE_CENTRAL;
    }
  else
    {
      commMem.txCompleteData.connHandle = pBleNrfEvt->evt.gattc_evt.conn_handle;
      commMem.txCompleteData.count = pBleNrfEvt->evt.gattc_evt.params.write_cmd_tx_complete.count;
      commMem.txCompleteData.role = BLE_ROLE_PERIPHERAL;
    }
  pBleEvent->evtDataSize = sizeof(BLE_EvtTxComplete);
  memcpy(pBleEvent->evtData, &commMem.txCompleteData, pBleEvent->evtDataSize);
}

static void onConnect_hal(void)
{
  struct bt_event_conn_stat_t con_stat_evt;

  #ifdef BLE_DBGPRT_ENABLE
  uint8_t connect = 0;
  uint8_t type = 0;
  uint8_t reason = 0;
  #endif
  /* Copy device address */

  memcpy(&con_stat_evt.addr, commMem.connectData.addr.addr, sizeof(BT_ADDR));

  /* Copy connect status */

  con_stat_evt.connected = true;

  /* Copy type */
//   type = commMem.connectData.addr.type;
//   con_stat_evt.status = reason;

  con_stat_evt.group_id = BT_GROUP_COMMON;
  con_stat_evt.event_id = BT_COMMON_EVENT_CONN_STAT_CHANGE;

  BLE_PRT("addr: %02x.%02x.%02x.%02x.%02x,%02x is connect:%d,"
      "transport type: %x, disconnect reason: %x.\n",
    con_stat_evt.addr.address[0], con_stat_evt.addr.address[1],
    con_stat_evt.addr.address[2], con_stat_evt.addr.address[3],
    con_stat_evt.addr.address[4], con_stat_evt.addr.address[5],
    connect, type, reason);

  bt_common_event_handler((struct bt_event_t *) &con_stat_evt);
}

static int searchBondInfoIndex(ble_gap_master_id_t *id)
{
  int i;

  uint32_t list = bleBondEnableList;

  for (i = 0; i < BLE_SAVE_BOND_DEVICE_MAX_NUM; i++, list >>= 1)
    {
      if (list & 1)
        {
          if (memcmp(&BondInfoInFlash[i].ownEncKey.master_id,
                    id,
                    sizeof(ble_gap_master_id_t))
               == 0)
            {
              break;
            }
        }
    }

  return i;
}

static
void onConnect(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_CONNECTED;
  ble_gap_evt_connected_t *connected = &pBleNrfEvt->evt.gap_evt.params.connected;
  commMem.connectData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.connectData.addr.type = connected->peer_addr.addr_type;
  memcpy(commMem.connectData.addr.addr, connected->peer_addr.addr, BLE_GAP_ADDR_LENGTH);
  if (connected->role == BLE_GAP_ROLE_PERIPH )
    {
      commMem.connectData.role   = BLE_ROLE_PERIPHERAL;
    }
  else if (connected->role == BLE_GAP_ROLE_CENTRAL)
    {
      commMem.connectData.role   = BLE_ROLE_CENTRAL;
    }
  commMem.gapMem->connParams = *(ble_gap_conn_params_t *)&connected->conn_params;
#ifdef BLE_DBGPRT_ENABLE
  BLE_PRT("onConnect: handle=%d\n", commMem.connectData.handle);
  BLE_PRT("onConnect: role=%d\n", commMem.connectData.role);
  BLE_PRT("onConnect: type=%d\n", commMem.connectData.addr.type);
  BLE_PRT("onConnect: addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", commMem.connectData.addr.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onConnect: minConnInterval=%d\n", commMem.gapMem->connParams.min_conn_interval);
  BLE_PRT("onConnect: maxConnInterval=%d\n", commMem.gapMem->connParams.max_conn_interval);
  BLE_PRT("onConnect: slaveLatency=%d\n", commMem.gapMem->connParams.slave_latency);
  BLE_PRT("onConnect: connSupTimeout=%d\n", commMem.gapMem->connParams.conn_sup_timeout);
#endif
  commMem.gapMem->wrapperBondInfo.connHandle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.gapMem->wrapperBondInfo.bondInfo.addrType = connected->peer_addr.addr_type;
  memcpy(commMem.gapMem->wrapperBondInfo.bondInfo.addr, connected->peer_addr.addr, BLE_GAP_ADDR_LENGTH);
  pBleEvent->evtDataSize = sizeof(BLE_EvtConnected);
  memcpy(pBleEvent->evtData, &commMem.connectData, pBleEvent->evtDataSize);

  //notify to hal layer
  onConnect_hal();

  on_connected((BLE_EvtConnected*)pBleEvent->evtData);
}

static
void onConnParamUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_CONN_PARAM_UPDATE;
  ble_gap_conn_params_t *params = &pBleNrfEvt->evt.gap_evt.params.conn_param_update.conn_params;
  commMem.connParams.connParams.minConnInterval = params->min_conn_interval;
  commMem.connParams.connParams.maxConnInterval = params->max_conn_interval;
  commMem.connParams.connParams.slaveLatency = params->slave_latency;
  commMem.connParams.connParams.connSupTimeout = params->conn_sup_timeout;
  commMem.gapMem->connParams = *(ble_gap_conn_params_t *)params;
  pBleEvent->evtDataSize = sizeof(BLE_EvtConnParamUpdate);
  memcpy(pBleEvent->evtData, &commMem.connParams, pBleEvent->evtDataSize);

  on_conn_params_update((BLE_EvtConnParamUpdate*)pBleEvent->evtData);
}

static
void onConnParamUpdateRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_CONN_PARAM_UPDATE_REQUEST;
  ble_gap_conn_params_t *params = &pBleNrfEvt->evt.gap_evt.params.conn_param_update_request.conn_params;
  commMem.connParams.connParams.minConnInterval = params->min_conn_interval;
  commMem.connParams.connParams.maxConnInterval = params->max_conn_interval;
  commMem.connParams.connParams.slaveLatency = params->slave_latency;
  commMem.connParams.connParams.connSupTimeout = params->conn_sup_timeout;
  commMem.gapMem->connParams = *(ble_gap_conn_params_t *)params;
  pBleEvent->evtDataSize = sizeof(BLE_EvtConnParamUpdate);
  memcpy(pBleEvent->evtData, &commMem.connParams, pBleEvent->evtDataSize);
}

static
void saveSysAttrData(ble_gap_master_id_t *id, uint8_t *sys_attr_data)
{
  int index;

  index = searchBondInfoIndex(id);

  if (index < BLE_SAVE_BOND_DEVICE_MAX_NUM)
    {
      memcpy(BondInfoInFlash[index].sys_attr_data, sys_attr_data, BLE_GATTS_SYS_ATTR_DATA_TOTALLEN);
      BSO_SetRegistryValue(bleKey.info_key[index],
                           (const void*)&BondInfoInFlash[index],
                           sizeof(bleGapWrapperBondInfo));
      mk_save_bondinfo_event();
    }
}

static
void onDisconnect(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  uint16_t len = BLE_GATTS_SYS_ATTR_DATA_TOTALLEN;
  uint8_t sys_attr_data[BLE_GATTS_SYS_ATTR_DATA_TOTALLEN];

