sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  pBleEvent->evtHeader = BLE_GAP_EVENT_DISCONNECTED;
  commMem.disconnectData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.disconnectData.reason = pBleNrfEvt->evt.gap_evt.params.disconnected.reason;
  BLE_PRT("onDisconnect: reason=%d\n", pBleNrfEvt->evt.gap_evt.params.disconnected.reason);
  pBleEvent->evtDataSize = sizeof(BLE_EvtDisconnected);
  memcpy(pBleEvent->evtData, &commMem.disconnectData, pBleEvent->evtDataSize);
  commMem.gapMem->is_connected = false;

  on_disconnected((BLE_EvtDisconnected*)pBleEvent->evtData);

  /* Save system attribute data for next connection. */

  sd_ble_gatts_sys_attr_get(pBleNrfEvt->evt.gap_evt.conn_handle,
                            sys_attr_data,
                            &len,
                            0);

  saveSysAttrData(&commMem.gapMem->wrapperBondInfo.ownEncKey.master_id, sys_attr_data);
}

static
void onSecParamsRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  ble_gap_evt_sec_params_request_t *secParamReq = &pBleNrfEvt->evt.gap_evt.params.sec_params_request;
  pBleEvent->evtHeader = BLE_GAP_EVENT_EXCHANGE_FEATURE;
  commMem.exchangeFeatureData.handle              = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.exchangeFeatureData.peerFeature.oob     = (BLE_GapOOB)secParamReq->peer_params.oob;
  commMem.exchangeFeatureData.peerFeature.ioCap   = (BLE_GAP_IO_CAP)secParamReq->peer_params.io_caps;
  commMem.exchangeFeatureData.peerFeature.authReq = (BLE_GapAuth)((secParamReq->peer_params.mitm)<<1 |(secParamReq->peer_params.bond));
  commMem.exchangeFeatureData.peerFeature.maxKeySize = secParamReq->peer_params.max_key_size;
  commMem.exchangeFeatureData.peerFeature.minKeySize = secParamReq->peer_params.min_key_size;
  pBleEvent->evtDataSize = sizeof(BLE_EvtExchangeFeature);
  memcpy(pBleEvent->evtData, &commMem.exchangeFeatureData, pBleEvent->evtDataSize);

  on_exchange_feature((BLE_EvtExchangeFeature*)pBleEvent->evtData);
}

static
void onAuthStatus(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_AUTH_STATUS;
  ble_gap_evt_auth_status_t *authStatus = &pBleNrfEvt->evt.gap_evt.params.auth_status;
  commMem.authStatusData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
#ifdef BLE_DBGPRT_ENABLE
  BLE_PRT("onAuthStatus: handle=%d\n", pBleNrfEvt->evt.gap_evt.conn_handle);
  BLE_PRT("onAuthStatus: auth_status=%d\n", authStatus->auth_status);
  BLE_PRT("onAuthStatus: error_src=%d\n", authStatus->error_src);
  BLE_PRT("onAuthStatus: bonded=%d\n", authStatus->bonded);
  BLE_PRT("onAuthStatus: lesc=%d\n", authStatus->lesc);
  BLE_PRT("onAuthStatus: sm1_levels_lv1=%d\n", authStatus->sm1_levels.lv1);
  BLE_PRT("onAuthStatus: sm1_levels_lv2=%d\n", authStatus->sm1_levels.lv2);
  BLE_PRT("onAuthStatus: sm1_levels_lv3=%d\n", authStatus->sm1_levels.lv3);
  BLE_PRT("onAuthStatus: sm2_levels_lv1=%d\n", authStatus->sm2_levels.lv1);
  BLE_PRT("onAuthStatus: sm2_levels_lv2=%d\n", authStatus->sm2_levels.lv2);
  BLE_PRT("onAuthStatus: sm2_levels_lv3=%d\n", authStatus->sm2_levels.lv3);
  BLE_PRT("onAuthStatus: own.enc=%d\n", authStatus->kdist_own.enc);
  BLE_PRT("onAuthStatus: own.id=%d\n", authStatus->kdist_own.id);
  BLE_PRT("onAuthStatus: own.sign=%d\n", authStatus->kdist_own.sign);
  BLE_PRT("onAuthStatus: own.link=%d\n", authStatus->kdist_own.link);
  BLE_PRT("onAuthStatus: peer.enc=%d\n", authStatus->kdist_peer.enc);
  BLE_PRT("onAuthStatus: peer.id=%d\n", authStatus->kdist_peer.id);
  BLE_PRT("onAuthStatus: peer.sign=%d\n", authStatus->kdist_peer.sign);
  BLE_PRT("onAuthStatus: peer.link=%d\n", authStatus->kdist_peer.link);
#if 0
  // own
  BLE_PRT("onAuthStatus: own id_irk=0x");
  for (int i=0; i<16; i++) {
    BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownIdKey.id_info.irk[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onAuthStatus: own id_addr_type=%d\n", commMem.gapMem->wrapperBondInfo.ownIdKey.id_addr_info.addr_type);
  BLE_PRT("onAuthStatus: own id_addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownIdKey.id_addr_info.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onAuthStatus: own master_id_ediv=%d\n", commMem.gapMem->wrapperBondInfo.ownEncKey.master_id.ediv);
  BLE_PRT("onAuthStatus: own master_id_rand=0x");
  for (int i=0; i<8; i++) {
    BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownEncKey.master_id.rand[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onAuthStatus: own enc_info_auth=%d\n", commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.auth);
  if (commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk_len) {
    BLE_PRT("onAuthStatus: own enc_info_ltk=0x");
    for (int i=0; i<commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk_len; i++) {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk[i]);
    }
    BLE_PRT("\n");
  } else {
    BLE_PRT("onAuthStatus: own enc_info_ltk=%d\n", commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk_len);
  }
#endif
  // peer
  BLE_PRT("onAuthStatus: peer id_irk=0x");
  for (int i=0; i<16; i++)
    {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerIdKey.id_info.irk[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onAuthStatus: peer id_addr_type=%d\n", commMem.gapMem->wrapperBondInfo.peerIdKey.id_addr_info.addr_type);
  BLE_PRT("onAuthStatus: peer id_addr=0x");
  for (int i=0; i<6; i++)
    {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerIdKey.id_addr_info.addr[i]);
    }
  BLE_PRT("\n");

  BLE_PRT("onAuthStatus: peer master_id_ediv=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.master_id.ediv);
  BLE_PRT("onAuthStatus: peer master_id_rand=0x");
  for (int i=0; i<8; i++)
    {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerEncKey.master_id.rand[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onAuthStatus: peer enc_info_auth=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.auth);
  if (commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len)
    {
      BLE_PRT("onAuthStatus: peer enc_info_ltk=0x");
      for (int i=0; i<commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len; i++)
        {
          BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk[i]);
        }
      BLE_PRT("\n");
    }
  else
    {
      BLE_PRT("onAuthStatus: peer enc_info_ltk=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len);
    }
#endif
  //Auth status code.
  if ( authStatus->auth_status < BLE_GAP_SEC_STATUS_PDU_INVALID )
    {
      commMem.authStatusData.status = authStatus->auth_status;
    }
  else if ((authStatus->auth_status > BLE_GAP_SEC_STATUS_RFU_RANGE1_END) && (authStatus->auth_status != BLE_GAP_SEC_STATUS_RFU_RANGE2_END))
    {
      commMem.authStatusData.status = authStatus->auth_status -(BLE_GAP_SEC_STATUS_RFU_RANGE1_END - BLE_GAP_SM_STATUS_RESERVED);
    }
  else
    {
      commMem.authStatusData.status = BLE_GAP_SM_STATUS_RESERVED;
    }
#if 1
  if (authStatus->kdist_peer.id)
    {
      BLE_PRT("update bondinfo\n");
      commMem.gapMem->wrapperBondInfo.bondInfo.addrType = commMem.gapMem->wrapperBondInfo.peerIdKey.id_addr_info.addr_type;
      memcpy(commMem.gapMem->wrapperBondInfo.bondInfo.addr, commMem.gapMem->wrapperBondInfo.peerIdKey.id_addr_info.addr, BLE_GAP_ADDR_LENGTH);
    }
#endif
  memcpy(&commMem.authStatusData.bondInfo, &commMem.gapMem->wrapperBondInfo.bondInfo, sizeof(BLE_GapBondInfo));
  pBleEvent->evtDataSize = sizeof(BLE_EvtAuthStatus);
  memcpy(pBleEvent->evtData, &commMem.authStatusData, pBleEvent->evtDataSize);

  on_auth_status((BLE_EvtAuthStatus*)pBleEvent->evtData);
}

static
void onDispPasskey(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_DISPLAY_PASSKEY;
  ble_gap_evt_passkey_display_t *dispPasskey = &pBleNrfEvt->evt.gap_evt.params.passkey_display;
  commMem.dispPasskeyData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  memcpy(commMem.dispPasskeyData.passkey,dispPasskey->passkey,BLE_GAP_PASSKEY_LEN);
  commMem.dispPasskeyData.passkey[BLE_GAP_PASSKEY_LEN] = '\0';
  pBleEvent->evtDataSize = sizeof(BLE_EvtDisplayPasskey);
  memcpy(pBleEvent->evtData, &commMem.dispPasskeyData, pBleEvent->evtDataSize);

  on_disp_passkey((BLE_EvtDisplayPasskey*)pBleEvent->evtData);
}

#if NRF_SD_BLE_API_VERSION > 5
extern uint8_t bleAdvReportBuffer[BLE_GAP_SCAN_BUFFER_EXTENDED_MIN];
#endif

static
void onAdvReport(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_ADV_REPORT;
  ble_gap_evt_adv_report_t *advReport = &pBleNrfEvt->evt.gap_evt.params.adv_report;
#if NRF_SD_BLE_API_VERSION > 5
  BLE_PRT("onAdvReport: rssi=%d scan_rsp=%d type=%d dlen=%d\n",
    advReport->rssi, advReport->type.scan_response, advReport->type.status, advReport->data.len);
  BLE_PRT("             connectable=%d scannable=%d directed=%d ext_pdu=%d set=%d dat=%d\n",
    advReport->type.connectable, advReport->type.scannable, advReport->type.directed,
    advReport->type.extended_pdu, advReport->set_id, advReport->data_id);

  if (advReport->type.status == BLE_GAP_ADV_DATA_STATUS_COMPLETE)
    {
      commMem.advReportData.dlen = advReport->data.len;
      memcpy(commMem.advReportData.data, advReport->data.p_data, advReport->data.len);
    }

  commMem.advReportData.scan_rsp = advReport->type.scan_response;
  commMem.advReportData.dlen = advReport->data.len;
  memcpy(commMem.advReportData.data, advReport->data.p_data, advReport->data.len);
  commMem.advReportData.rssi = advReport->rssi;
  memcpy(commMem.advReportData.addr.addr, advReport->peer_addr.addr, BLE_GAP_ADDR_LENGTH);
  commMem.advReportData.addr.type = advReport->peer_addr.addr_type;
  pBleEvent->evtDataSize = sizeof(BLE_EvtAdvReportData);
  memcpy(pBleEvent->evtData, &commMem.advReportData, pBleEvent->evtDataSize);
  ble_data_t bleAdvReport = {bleAdvReportBuffer, BLE_GAP_SCAN_BUFFER_EXTENDED_MIN};
  if (sd_ble_gap_scan_start(NULL, &bleAdvReport))
    {
      BLE_ERR("sd_ble_gap_scan_start failed.\n");
    }
#else
  BLE_PRT("onAdvReport: rssi=%d scan_rsp=%d type=%d dlen=%d\n",
    advReport->rssi, advReport->scan_rsp, advReport->type, advReport->dlen);
  commMem.advReportData.scan_rsp = advReport->scan_rsp;
  commMem.advReportData.dlen = advReport->dlen;
  memcpy(commMem.advReportData.data, advReport->data, BLE_GAP_ADV_MAX_SIZE);
  commMem.advReportData.rssi = advReport->rssi;
  memcpy(commMem.advReportData.addr.addr, advReport->peer_addr.addr, BLE_GAP_ADDR_LENGTH);
  commMem.advReportData.addr.type = advReport->peer_addr.addr_type;
  pBleEvent->evtDataSize = sizeof(BLE_EvtAdvReportData);
  memcpy(pBleEvent->evtData, &commMem.advReportData, pBleEvent->evtDataSize);
#endif

  on_adv_report((BLE_EvtAdvReportData *)pBleEvent->evtData);
}

static
void onAuthKeyRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_AUTH_KEY_REQUEST;
  ble_gap_evt_auth_key_request_t *authKey = &pBleNrfEvt->evt.gap_evt.params.auth_key_request;
  commMem.authKeyData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.authKeyData.keyType = authKey->key_type;
  pBleEvent->evtDataSize = sizeof(BLE_EvtAuthKey);
  memcpy(pBleEvent->evtData, &commMem.authKeyData, pBleEvent->evtDataSize);

  on_auth_key_request((BLE_EvtAuthKey *)pBleEvent->evtData);
}

static
void onConnSecUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_CONN_SEC_UPDATE;
  pBleEvent->evtDataSize = 0;
#ifdef BLE_DBGPRT_ENABLE
  ble_gap_evt_conn_sec_update_t *sec = &pBleNrfEvt->evt.gap_evt.params.conn_sec_update;
  BLE_PRT("onConnSecUpdate: keysize=%d sm=%d lv=%d\n", sec->conn_sec.encr_key_size,
    sec->conn_sec.sec_mode.sm, sec->conn_sec.sec_mode.lv);
#endif
}

static
void onSecInfoRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  ble_gap_enc_info_t *enc_info = NULL;
  ble_gap_irk_t *id_info = NULL;
  ble_gap_sign_info_t *sign_info = NULL;
  ble_gap_evt_sec_info_request_t *secinfo = &pBleNrfEvt->evt.gap_evt.params.sec_info_request;
  uint8_t *sys_attr_data = NULL;
  int index;
#ifdef BLE_DBGPRT_ENABLE
  BLE_PRT("onSecInfoRequest: handle=%d\n", pBleNrfEvt->evt.gap_evt.conn_handle);
  BLE_PRT("onSecInfoRequest: addr_type=%d\n", secinfo->peer_addr.addr_type);
  BLE_PRT("onSecInfoRequest: peer_addr=0x");
  for (int i=0; i<6; i++)
    {
      BLE_PRT("%02x", secinfo->peer_addr.addr[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: master_id_ediv=%d\n", secinfo->master_id.ediv);
  BLE_PRT("onSecInfoRequest: master_id_rand=0x");
  for (int i=0; i<8; i++)
    {
      BLE_PRT("%02x", secinfo->master_id.rand[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: enc_info=%d\n", secinfo->enc_info);
  BLE_PRT("onSecInfoRequest: id_info=%d\n", secinfo->id_info);
  BLE_PRT("onSecInfoRequest: sign_info=%d\n", secinfo->sign_info);
#if 0
  // own
  BLE_PRT("onSecInfoRequest: own id_irk=0x");
  for (int i=0; i<16; i++) {
    BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownIdKey.id_info.irk[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: own id_addr_type=%d\n", commMem.gapMem->wrapperBondInfo.ownIdKey.id_addr_info.addr_type);
  BLE_PRT("onSecInfoRequest: own id_addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownIdKey.id_addr_info.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: own master_id_ediv=%d\n", commMem.gapMem->wrapperBondInfo.ownEncKey.master_id.ediv);
  BLE_PRT("onSecInfoRequest: own master_id_rand=0x");
  for (int i=0; i<8; i++) {
    BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownEncKey.master_id.rand[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: own enc_info_auth=%d\n", commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.auth);
  if (commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk_len) {
    BLE_PRT("onSecInfoRequest: own enc_info_ltk=0x");
    for (int i=0; i<commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk_len; i++) {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.ownEncKey.enc_info.ltk[i]);
    }
    BLE_PRT("\n");
  } else {
    BLE_PRT("onSecInfoRequest: own enc_info_ltk=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len);
  }
#endif
  // peer
  BLE_PRT("onSecInfoRequest: peer id_irk=0x");
  for (int i=0; i<16; i++)
    {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerIdKey.id_info.irk[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: peer id_addr_type=%d\n", commMem.gapMem->wrapperBondInfo.peerIdKey.id_addr_info.addr_type);
  BLE_PRT("onSecInfoRequest: peer id_addr=0x");
  for (int i=0; i<6; i++)
    {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerIdKey.id_addr_info.addr[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: peer master_id_ediv=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.master_id.ediv);
  BLE_PRT("onSecInfoRequest: peer master_id_rand=0x");
  for (int i=0; i<8; i++)
    {
      BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerEncKey.master_id.rand[i]);
    }
  BLE_PRT("\n");
  BLE_PRT("onSecInfoRequest: peer enc_info_auth=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.auth);
  if (commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len)
    {
      BLE_PRT("onSecInfoRequest: peer enc_info_ltk=0x");
      for (int i=0; i<commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len; i++)
        {
          BLE_PRT("%02x", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk[i]);
        }
      BLE_PRT("\n");
    }
  else
    {
      BLE_PRT("onSecInfoRequest: peer enc_info_ltk=%d\n", commMem.gapMem->wrapperBondInfo.peerEncKey.enc_info.ltk_len);
    }
#endif

  index = searchBondInfoIndex(&secinfo->master_id);

