sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  if (index < BLE_SAVE_BOND_DEVICE_MAX_NUM)
    {
      BLE_PRT("onSecInfoRequest: master_id exitsting index %d\n", index);
      enc_info = &BondInfoInFlash[index].ownEncKey.enc_info;
      id_info = &BondInfoInFlash[index].ownIdKey.id_info;
      sys_attr_data = BondInfoInFlash[index].sys_attr_data;
    }

  memcpy(&commMem.gapMem->wrapperBondInfo.ownEncKey.master_id,
         &secinfo->master_id,
         sizeof(ble_gap_master_id_t));
  memcpy(&commMem.gapMem->wrapperBondInfo.sys_attr_data,
         sys_attr_data,
         BLE_GATTS_SYS_ATTR_DATA_TOTALLEN);
  sd_ble_gap_sec_info_reply(pBleNrfEvt->evt.gap_evt.conn_handle, enc_info, id_info, sign_info);
  sd_ble_gatts_sys_attr_set(pBleNrfEvt->evt.gap_evt.conn_handle,
                            sys_attr_data,
                            BLE_GATTS_SYS_ATTR_DATA_TOTALLEN,
                            0);
}

static
void onTimeout(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_TIMEOUT;
  ble_gap_evt_timeout_t *timeout = &pBleNrfEvt->evt.gap_evt.params.timeout;
  commMem.timeoutData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.timeoutData.timeoutSrc = timeout->src;
  pBleEvent->evtDataSize = sizeof(BLE_EvtTimeout);
  memcpy(pBleEvent->evtData, &commMem.timeoutData, pBleEvent->evtDataSize);

  on_timeout((BLE_EvtTimeout *)pBleEvent->evtData);
}

static
void onGattsTimeout(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTS_EVENT_TIMEOUT;
  commMem.timeoutData.handle = pBleNrfEvt->evt.gatts_evt.conn_handle;
  commMem.timeoutData.timeoutSrc = BLE_GATT_TIMEOUT_PROTOCOL;
  pBleEvent->evtDataSize = sizeof(BLE_EvtTimeout);
  memcpy(pBleEvent->evtData, &commMem.timeoutData, pBleEvent->evtDataSize);
}

static
void onRssiChanged(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_RSSI_CHANGED;
  ble_gap_evt_rssi_changed_t *rssiChanged = &pBleNrfEvt->evt.gap_evt.params.rssi_changed;
  commMem.rssiChangeData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.rssiChangeData.rssi = rssiChanged->rssi;
  commMem.gapMem->peerRssi = rssiChanged->rssi;
  pBleEvent->evtDataSize = sizeof(BLE_EvtRssiChanged);
  memcpy(pBleEvent->evtData, &commMem.rssiChangeData, pBleEvent->evtDataSize);

  on_rssi_changed((BLE_EvtRssiChanged*)pBleEvent->evtData);
}

static void mk_notify_req_event(BLE_SrvSds *srv)
{
  struct ble_gatt_event_notify_req_t notify;

  notify.group_id    = BLE_GROUP_GATT;
  notify.event_id    = BLE_GATT_EVENT_NOTIFY_REQ;
  notify.serv_handle = BLE_GATT_INVALID_SERVICE_HANDLE;
  notify.char_handle = srv->char_ri_handle.charHandle;
  notify.enable      = srv->notify_enabled;

  ble_gatt_event_handler((struct bt_event_t *)&notify);
}

static void mk_write_req_event(ble_gatts_evt_write_t *gattsWrite)
{
  struct ble_gatt_event_write_req_t write;

  write.group_id    = BLE_GROUP_GATT;
  write.event_id    = BLE_GATT_EVENT_WRITE_REQ;
  write.serv_handle = BLE_GATT_INVALID_SERVICE_HANDLE;
  write.char_handle = gattsWrite->handle;
  write.length      = gattsWrite->len;
  memcpy(write.data, gattsWrite->data, write.length);

  ble_gatt_event_handler((struct bt_event_t *)&write);
}

static
void onGattsWrite(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  ble_gatts_evt_write_t * gattsWrite = &pBleNrfEvt->evt.gatts_evt.params.write;
  BLE_SrvSds* srv_sds = &g_ble_context.ble_srv_sds;

  BLE_PRT("gattsWrite->data:%.*s\n",gattsWrite->len, gattsWrite->data);
  BLE_PRT("gattsWrite->handle:%x\n",gattsWrite->handle);
  BLE_PRT("srv_sds->char_ri_handle.dprHandle.cccdHandle:%x\n",
          srv_sds->char_ri_handle.dprHandle.cccdHandle);
  BLE_PRT("gattsWrite->data[0] & 0x01:%d\n",gattsWrite->data[0] & 0x01);

  if (gattsWrite->handle == srv_sds->char_ri_handle.dprHandle.cccdHandle)
    {
      /* client characteristic configuration.bit 0: Notification bit 1: Indication.other reserved.
       * see core spec 4.1 Vol3,PartG,3,3,3,3 client characteristic
       * configuration.Table 3.11
       */

      srv_sds->notify_enabled = (bool)gattsWrite->data[0] & 0x01;

      mk_notify_req_event(srv_sds);
    }
  else
    {
      if (BT_MAX_EVENT_DATA_LEN >= gattsWrite->len)
        {
          mk_write_req_event(gattsWrite);
        }
      else
        {
          BLE_PRT("incoming data exceeds buffer length\n");
        }
    }
}

static
void onGattsIndConfirm(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTS_EVENT_CFM;
  ble_gatts_evt_hvc_t * gattsConfirm = &pBleNrfEvt->evt.gatts_evt.params.hvc;
  commMem.gattsIndConfirmData.connHandle    = pBleNrfEvt->evt.gatts_evt.conn_handle;
  commMem.gattsIndConfirmData.handle        = gattsConfirm->handle;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattsIndConfirm);
  memcpy(pBleEvent->evtData, &commMem.gattsIndConfirmData, pBleEvent->evtDataSize);
}

static void onReadRsp(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTC_EVENT_READ;
  ble_gattc_evt_t *bleGattcEvt                         = &(pBleNrfEvt->evt.gattc_evt);
  const ble_gattc_evt_read_rsp_t *bleGattcEvtReadRsp   = &(bleGattcEvt->params.read_rsp);
  commMem.gattcReadData.connHandle    = pBleNrfEvt->evt.gattc_evt.conn_handle;
  commMem.gattcReadData.charValHandle = bleGattcEvtReadRsp->handle;
  commMem.gattcReadData.charValLen    = bleGattcEvtReadRsp->len;
  memcpy(commMem.gattcReadData.charValData, bleGattcEvtReadRsp->data, MAX_VAL_DATA_LENGTH);
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcRead);
  memcpy(pBleEvent->evtData, &commMem.gattcReadData, pBleEvent->evtDataSize);

  on_read_rsp((BLE_EvtGattcRead *)pBleEvent->evtData);
}

static void onWriteRsp(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTC_EVENT_WRITE_RSP;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcWriteRsp);

  ble_gattc_evt_t *bleGattcEvt                         = &(pBleNrfEvt->evt.gattc_evt);
  const ble_gattc_evt_write_rsp_t *bleGattcEvtWriteRsp   = &(bleGattcEvt->params.write_rsp);
  struct ble_gatt_event_write_rsp_t evt;

  evt.group_id    = BLE_GROUP_GATT;
  evt.event_id    = BLE_GATT_EVENT_WRITE_RESP;
  evt.conn_handle = bleGattcEvt->conn_handle;
  evt.char_handle = bleGattcEvtWriteRsp->handle;
  evt.status      = bleGattcEvt->gatt_status;

  ble_gatt_event_handler((struct bt_event_t *)&evt);
}

static
void onHvx(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTC_EVENT_NTFIND;
  ble_gattc_evt_t *bleGattcEvt                = &(pBleNrfEvt->evt.gattc_evt);
  const ble_gattc_evt_hvx_t *bleGattcEvtHvx   = &(bleGattcEvt->params.hvx);
  commMem.gattcNtfIndData.connHandle   = pBleNrfEvt->evt.gattc_evt.conn_handle;
  commMem.gattcNtfIndData.attrHandle   = bleGattcEvtHvx->handle;
  commMem.gattcNtfIndData.type         = (BLE_GattNtyIndType)bleGattcEvtHvx->type;
  commMem.gattcNtfIndData.attrValLen   = bleGattcEvtHvx->len;
  memcpy(commMem.gattcNtfIndData.attrValData, bleGattcEvtHvx->data, MAX_VAL_DATA_LENGTH);
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcNtfInd);
  memcpy(pBleEvent->evtData, &commMem.gattcNtfIndData, pBleEvent->evtDataSize);
}

static
void onSysAttrMissing(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int ret = BLE_SUCCESS;
  ret = sd_ble_gatts_sys_attr_set(commMem.connectData.handle, NULL, 0, 0);
  if (ret) {
    pBleEvent->evtHeader = BLE_GATTS_EVENT_SYS_ATTR_MISSING;
  }
}

static void set_discoveried_data(BLE_GattcDbDiscovery *rcv,
                                 struct ble_gattc_db_discovery_s *evt)
{
  int i;
  int j;
  BLE_GattcDbDiscSrv  *rcv_srv;
  BLE_GattcDbDiscChar *rcv_ch;
  struct ble_gattc_db_disc_srv_s  *srv;
  struct ble_gattc_db_disc_char_s *ch;

  evt->srv_count = rcv->srvCount;

