sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  srv = &evt->services[0];
  rcv_srv = &rcv->services[0];

  for (i = 0; i < evt->srv_count; i++, srv++, rcv_srv++)
    {
      srv->char_count = rcv_srv->charCount;
      srv->srv_handle_range.start_handle = rcv_srv->srvHandleRange.startHandle;
      srv->srv_handle_range.end_handle   = rcv_srv->srvHandleRange.endHandle;

      ch = &srv->characteristics[0];
      rcv_ch = &rcv_srv->characteristics[0];

      for (j = 0; j < evt->srv_count; j++, ch++, rcv_ch++)
        {
           ch->characteristic.char_prope      = rcv_ch->characteristic.charPrope;
           ch->characteristic.char_valhandle  = rcv_ch->characteristic.charValhandle;
           ch->characteristic.char_declhandle = rcv_ch->characteristic.charDeclhandle;
           memcpy(&ch->characteristic.char_valuuid,
                  &rcv_ch->characteristic.charValUuid,
                  sizeof(BLE_UUID));
           ch->cccd_handle = rcv_ch->cccdHandle;
        }
    }
}

static
void setDbDiscoveryEvent(BLE_Evt *pBleEvent, uint16_t connHandle, int result, int reason)
{
  struct ble_gatt_event_db_discovery_t evt;
  struct ble_gattc_db_disc_srv_s *last;

  evt.group_id    = BLE_GROUP_GATT;
  evt.event_id    = BLE_GATT_EVENT_DB_DISCOVERY_COMPLETE;
  evt.result      = result;
  evt.conn_handle = connHandle;

  if (evt.result == BLE_GATTC_RESULT_SUCCESS)
    {
      set_discoveried_data(&commMem.gattcDb.dbDiscovery, &evt.params.db_discovery);
    }
  else
    {
      evt.params.reason = reason;
    }

  last = &evt.params.db_discovery.services[evt.params.db_discovery.srv_count - 1];
  evt.state.end_handle = last->srv_handle_range.end_handle;

  ble_gatt_event_handler((struct bt_event_t *)&evt);

  /* Initialize nrf52's local data. */

  memset(&commMem.gattcDb, 0, sizeof(commMem.gattcDb));
  commMem.gattcDb.currCharInd = 0;
  commMem.gattcDb.currSrvInd  = 0;
  return;
}

static
void onPrimarySrvDiscoveryRsp(bleGattcDb *gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int i;
  uint16_t connHandle = 0;
  ble_gattc_evt_t *bleGattcEvt = &(pBleNrfEvt->evt.gattc_evt);
  ble_gattc_evt_prim_srvc_disc_rsp_t *srvs = &(bleGattcEvt->params.prim_srvc_disc_rsp);
  ble_gattc_service_t *srv;
  BLE_GattcDbDiscSrv *ltbl;
  int num;

  connHandle  = bleGattcEvt->conn_handle;
  BLE_PRT2("onPrimary start ind %d\n", gattcDbDiscovery->currSrvInd);
  if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
      if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
        {
          gattcDbDiscovery->discoveryInProgress = false;
          BLE_ERR("onPrimary MAX_SRV\n");
          setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_SERVICE);
          return;
        }

      gattcDbDiscovery->dbDiscovery.connHandle = connHandle;

      if (srvs->count > BLE_DB_DISCOVERY_MAX_SRV)
        {
          num = BLE_DB_DISCOVERY_MAX_SRV;
        }
      else
        {
          num = srvs->count;
        }

      gattcDbDiscovery->dbDiscovery.srvCount = num;

      for (i = 0, srv = &srvs->services[0], ltbl = &gattcDbDiscovery->dbDiscovery.services[0];
           i < num;
           i++, srv++, ltbl++)
        {
          ltbl->srvUuid.value.baseAlias.uuidAlias = srv->uuid.uuid;
          ltbl->srvUuid.type = (BLE_GATT_UUID_TYPE)srv->uuid.type;
          ltbl->srvHandleRange.startHandle =  srv->handle_range.start_handle;
          ltbl->srvHandleRange.endHandle =  srv->handle_range.end_handle;
          BLE_PRT2("Primary Service[%d] type %d uuid 0x%04X sHdl %d eHdl %d\n",
                   i,
                   srv->uuid.type,
                   srv->uuid.uuid,
                   srv->handle_range.start_handle,
                   srv->handle_range.end_handle);
        }

      //get current service info finished. characteristic discovery which belongs to this service.
      (void)characteristicsDiscover(pBleEvent, gattcDbDiscovery);
    }
  else if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_ATTERR_ATTRIBUTE_NOT_FOUND)
    {
      //db discovery complete.send success event to application
      gattcDbDiscovery->discoveryInProgress = true;
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_SUCCESS, 0);
    }
  else
    {
      //db discovery error.send event to application
      gattcDbDiscovery->discoveryInProgress = false;
      BLE_ERR("onPrimary Status error %d\n", bleGattcEvt->gatt_status);
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_SERVICE);
    }
}

static
void onCharacteristicDiscoveryRsp(bleGattcDb *const gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  uint8_t numCharsPrevDisc = 0;
  uint8_t numCharsCurrDisc = 0;
  uint16_t connHandle = 0;
  uint32_t i               = 0;
  uint32_t j               = 0;
  bool   performDescDiscov = false;
  bool raiseDiscovComplete = false;
  ble_gattc_evt_t                 *bleGattcEvt = &(pBleNrfEvt->evt.gattc_evt);
  BLE_GattcDbDiscSrv       *srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  BLE_GattcChar            *lastKnownChar = NULL;

  connHandle  = bleGattcEvt->conn_handle;
  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      BLE_ERR("onChar ind NG\n");
      gattcDbDiscovery->discoveryInProgress = false;
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_CHARACTERISTIC);
      return;
    }
  if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
      const ble_gattc_evt_char_disc_rsp_t * charDiscRspEvt;

      charDiscRspEvt = &(bleGattcEvt->params.char_disc_rsp);

      numCharsPrevDisc = srvBeingDiscovered->charCount;
      numCharsCurrDisc = charDiscRspEvt->count;
      BLE_PRT2("onChar preCnt %d curCnt %d\n", numCharsPrevDisc, numCharsCurrDisc);
      // Check if the total number of discovered characteristics are supported
      if ((numCharsPrevDisc + numCharsCurrDisc) <= BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV)
        {
          // Update the characteristics count.
          srvBeingDiscovered->charCount += numCharsCurrDisc;
        }
      else
        {
          // The number of characteristics discovered at the peer is more than the supported maximum.
          srvBeingDiscovered->charCount = BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV;
        }

      for (i = numCharsPrevDisc, j = 0; i < srvBeingDiscovered->charCount; i++, j++)
        {
          memcpy(&srvBeingDiscovered->characteristics[i].characteristic.charPrope, &charDiscRspEvt->chars[j].char_props, sizeof(BLE_CharPrope));
          srvBeingDiscovered->characteristics[i].characteristic.charDeclhandle = charDiscRspEvt->chars[j].handle_decl;
          srvBeingDiscovered->characteristics[i].characteristic.charValhandle  = charDiscRspEvt->chars[j].handle_value;
          srvBeingDiscovered->characteristics[i].characteristic.charValUuid.type = (BLE_GATT_UUID_TYPE)charDiscRspEvt->chars[j].uuid.type; //BLE_ENABLE_NORDIC_ORIGINAL
          srvBeingDiscovered->characteristics[i].characteristic.charValUuid.value.baseAlias.uuidAlias = charDiscRspEvt->chars[j].uuid.uuid; //BLE_ENABLE_NORDIC_ORIGINAL
          srvBeingDiscovered->characteristics[i].cccdHandle = BLE_GATT_HANDLE_INVALID;

          BLE_PRT2("onChar type %d uuid 0x%04X ValHdl %d DecHdl %d\n",
            charDiscRspEvt->chars[j].uuid.type,
            charDiscRspEvt->chars[j].uuid.uuid,
            charDiscRspEvt->chars[j].handle_value,
            charDiscRspEvt->chars[j].handle_decl);
        }

      lastKnownChar = &(srvBeingDiscovered->characteristics[i - 1].characteristic);

