sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
      // If no more characteristic discovery is required, or if the maximum number of supported
      // characteristic per service has been reached, descriptor discovery will be performed.
      if (!isCharDiscoveryReqd(gattcDbDiscovery, lastKnownChar) ||
      (srvBeingDiscovered->charCount == BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV))
        {
          performDescDiscov = true;
        }
      else
        {
          // Update the current characteristic index.
          gattcDbDiscovery->currCharInd = srvBeingDiscovered->charCount;
          // Perform another round of characteristic discovery.
          BLE_PRT2("onChar charDiscover\n");
          (void)characteristicsDiscover(pBleEvent, gattcDbDiscovery);
        }
    }
  else
    {
      // The previous characteristic discovery resulted in no characteristics.
      // descriptor discovery should be performed.
      performDescDiscov = true;
    }

  if (performDescDiscov)
    {
      gattcDbDiscovery->currCharInd = 0;
      BLE_PRT2("onChar charDiscover\n");
      (void)descriptorsDiscover(pBleEvent, gattcDbDiscovery, &raiseDiscovComplete);
      if (raiseDiscovComplete)
        {
          BLE_PRT2("onChar onSrvDiscCompletion\n");
          onSrvDiscCompletion(pBleEvent, gattcDbDiscovery);
        }
    }
}

static
void onDescriptorDiscoveryRsp(bleGattcDb *const gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  uint32_t i = 0;
  uint16_t connHandle = 0;
  bool raiseDiscovComplete = false;
  BLE_GattcDbDiscSrv *srvBeingDiscovered = NULL;
  ble_gattc_evt_t *bleGattcEvt = NULL;
  bleGattcEvt = &(pBleNrfEvt->evt.gattc_evt);
  BLE_PRT2("onDesc srvInd %d charInd %d\n",
    gattcDbDiscovery->currSrvInd, gattcDbDiscovery->currCharInd);
  srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  const ble_gattc_evt_desc_disc_rsp_t * descDiscRspEvt = &(bleGattcEvt->params.desc_disc_rsp);
  BLE_GattcDbDiscChar * charBeingDiscovered = &(srvBeingDiscovered->characteristics[gattcDbDiscovery->currCharInd]);

  connHandle  = bleGattcEvt->conn_handle;
  if ((gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV) ||
    (gattcDbDiscovery->currCharInd >= BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV))
    {
      BLE_ERR("onDesc ind NG\n");
      gattcDbDiscovery->discoveryInProgress = false;
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_DESCRIPTOR);
      return;
    }
  if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
      // The descriptor was found at the peer.
      // If the descriptor was a Client Characteristic Configuration Descriptor, then the cccdHandle needs to be populated.
      // Loop through all the descriptors to find the Client Characteristic Configuration Descriptor.
      for (i = 0; i < descDiscRspEvt->count; i++)
        {
          if (descDiscRspEvt->descs[i].uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
            {
              charBeingDiscovered->cccdHandle = descDiscRspEvt->descs[i].handle;
              BLE_PRT2("onDesc ccc %d\n", descDiscRspEvt->descs[i].handle);
              break;
            }
        }
    }

  if ((gattcDbDiscovery->currCharInd + 1) == srvBeingDiscovered->charCount)
    {
      // No more characteristics and descriptors need to be discovered. Discovery is complete.
      raiseDiscovComplete = true;
    }
  else
    {
      BLE_PRT2("onDesc retry descriptorsDiscover\n");
      // Begin discovery of descriptors for the next characteristic.
      gattcDbDiscovery->currCharInd++;
      (void)descriptorsDiscover(pBleEvent, gattcDbDiscovery, &raiseDiscovComplete);
    }
  if (raiseDiscovComplete)
    {
      BLE_PRT2("onDesc onSrvDiscCompletion\n");
      onSrvDiscCompletion(pBleEvent, gattcDbDiscovery);
    }
}

static
void onSrvDiscCompletion(BLE_Evt *pBleEvent, bleGattcDb *gattcDbDiscovery)
{
  BLE_GattcDbDiscSrv       *srvBeingDiscovered = NULL;

  // Reset the current characteristic index since a new service discovery is about to start.
  gattcDbDiscovery->currCharInd = 0;

  gattcDbDiscovery->currSrvInd++;
  if (gattcDbDiscovery->currSrvInd > BLE_DB_DISCOVERY_MAX_SRV)
    {
      BLE_ERR("onCompletion ind NG\n");
      goto err;
    }
  else
    {
      // Initiate discovery of the next service.
      if (gattcDbDiscovery->currSrvInd < BLE_DB_DISCOVERY_MAX_SRV)
        {
          srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
          // Reset the characteristic count in the current service to zero since a new service
          // discovery is about to start.
          srvBeingDiscovered->charCount = 0;
        }
    }

  setDbDiscoveryEvent(pBleEvent,
                      gattcDbDiscovery->dbDiscovery.connHandle,
                      BLE_GATTC_RESULT_SUCCESS, 0);

  return;
err:
  gattcDbDiscovery->discoveryInProgress = false;
  setDbDiscoveryEvent(pBleEvent, gattcDbDiscovery->dbDiscovery.connHandle,
    BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_SERVICE);
  return;
}

static
int characteristicsDiscover(BLE_Evt *pBleEvent, bleGattcDb *const gattcDbDiscovery)
{
  int ret = 0;
  uint8_t              prevCharInd = 0;
  BLE_GattcChar        *prevChar = NULL;
  BLE_GattcDbDiscSrv   *srvBeingDiscovered = NULL;
  BLE_GattcHandleRange handleRange = {0};
  BLE_PRT2("charDiscover start srvInd %d charInd %d\n",
    gattcDbDiscovery->currSrvInd, gattcDbDiscovery->currCharInd);
  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      BLE_ERR("charDiscover NG %d\n", NRF_ERROR_FORBIDDEN);
      goto err;
    }
  srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  if (gattcDbDiscovery->currCharInd != 0)
    {
      // This is not the first characteristic being discovered. Hence the 'start handle' to be
      // used must be computed using the charValhandle of the previous characteristic.

      prevCharInd = gattcDbDiscovery->currCharInd - 1;

      srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
      prevChar = &(srvBeingDiscovered->characteristics[prevCharInd].characteristic);
      handleRange.startHandle = prevChar->charValhandle + 1;
    }
  else
    {
      // This is the first characteristic of this service being discovered.
      handleRange.startHandle = srvBeingDiscovered->srvHandleRange.startHandle;
    }

  handleRange.endHandle = srvBeingDiscovered->srvHandleRange.endHandle;
  BLE_PRT2("charDiscover sHdl %d eHdl %d\n",
    handleRange.startHandle, handleRange.endHandle);
  ret = sd_ble_gattc_characteristics_discover(gattcDbDiscovery->dbDiscovery.connHandle,
    (ble_gattc_handle_range_t *)&handleRange);
  if (ret)
    {
      BLE_ERR("sd_ble_gattc_cdr NG %d\n", ret);
      goto err;
    }
  return 0;
err:
  gattcDbDiscovery->discoveryInProgress = false;
  setDbDiscoveryEvent(pBleEvent, gattcDbDiscovery->dbDiscovery.connHandle,
    BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_CHARACTERISTIC);
  return -1;
}

static
bool isCharDiscoveryReqd(bleGattcDb *const gattcDbDiscovery,
               BLE_GattcChar         *afterChar)
{
  BLE_PRT2("isChar charEndHdl %d srvEndHdl %d\n", afterChar->charValhandle,
    gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle);
  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      return false;
    }
  if (afterChar->charValhandle <
  gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle)
    {
      // Handle value of the characteristic being discovered is less than the end handle of
      // the service being discovered. There is a possibility of more characteristics being
      // present. Hence a characteristic discovery is required.
      return true;
    }
  return false;
}

static
bool isDescDiscoveryReqd(bleGattcDb       *gattcDbDiscovery,
                BLE_GattcDbDiscChar  *currChar,
                BLE_GattcDbDiscChar  *nextChar,
                BLE_GattcHandleRange *handleRange)
{
  BLE_PRT2("isDesc charValHdl %d srvEndHdl %d\n",
    currChar->characteristic.charValhandle,
    gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle);

  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      return false;
    }
  if (nextChar == NULL)
    {
      // Current characteristic is the last characteristic in the service. Check if the value
      // handle of the current characteristic is equal to the service end handle.
      if (currChar->characteristic.charValhandle ==
        gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle
      )
        {
          // No descriptors can be present for the current characteristic. currChar is the last
          // characteristic with no descriptors.
          return false;
        }

      handleRange->startHandle = currChar->characteristic.charValhandle + 1;

