sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
      // Since the current characteristic is the last characteristic in the service, the end
      // handle should be the end handle of the service.
      handleRange->endHandle = gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle;
      BLE_PRT2("isDesc start %d end %d\n", handleRange->startHandle, handleRange->endHandle);
      return true;
    }

  // nextChar != NULL. Check for existence of descriptors between the current and the next
  // characteristic.
  if ((currChar->characteristic.charValhandle + 1) == nextChar->characteristic.charDeclhandle)
    {
      // No descriptors can exist between the two characteristic.
      return false;
    }

  handleRange->startHandle = currChar->characteristic.charValhandle + 1;
  handleRange->endHandle   = nextChar->characteristic.charDeclhandle - 1;
  BLE_PRT2("isDesc start %d end %d\n", handleRange->startHandle, handleRange->endHandle);
  return true;
}
static
int descriptorsDiscover(BLE_Evt *pBleEvent, bleGattcDb *const gattcDbDiscovery, bool *raiseDiscovComplete)
{
  uint8_t                    i = 0;
  int                        ret = BLE_SUCCESS;
  BLE_GattcHandleRange       handleRange = {0};
  BLE_GattcDbDiscChar        *currCharBeingDiscovered = NULL;
  BLE_GattcDbDiscSrv         *srvBeingDiscovered = NULL;
  BLE_GattcDbDiscChar        *nextChar = NULL;
  bool                       isDiscoveryReqd = false;

  *raiseDiscovComplete = false;
  BLE_PRT2("descDiscover SrvInd %d CharInd %d\n",
    gattcDbDiscovery->currSrvInd, gattcDbDiscovery->currCharInd);
  if ((gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV) || (gattcDbDiscovery->currCharInd >= BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV))
    {
      BLE_ERR("descDiscover NG %d\n", NRF_ERROR_FORBIDDEN);
      goto err;
    }

  srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  currCharBeingDiscovered = &(srvBeingDiscovered->characteristics[gattcDbDiscovery->currCharInd]);

  if ((gattcDbDiscovery->currCharInd + 1) == srvBeingDiscovered->charCount)
    {
      // This is the last characteristic of this service.
      isDiscoveryReqd = isDescDiscoveryReqd(gattcDbDiscovery, currCharBeingDiscovered, NULL, &handleRange);
    }
  else
    {
      for (i = gattcDbDiscovery->currCharInd; i < srvBeingDiscovered->charCount; i++)
        {
          if (i == (srvBeingDiscovered->charCount - 1))
            {
              // The current characteristic is the last characteristic in the service.
              nextChar = NULL;
            }
          else
            {
              nextChar = &(srvBeingDiscovered->characteristics[i + 1]);
            }

          // Check if it is possible for the current characteristic to have a descriptor.
          if (isDescDiscoveryReqd(gattcDbDiscovery, currCharBeingDiscovered, nextChar, &handleRange))
            {
              isDiscoveryReqd = true;
              break;
            }
          else
            {
              // No descriptors can exist.
              currCharBeingDiscovered = nextChar;
              gattcDbDiscovery->currCharInd++;
            }
        }
    }

  if (!isDiscoveryReqd)
    {
      // No more descriptor discovery required.
      // Preceed to the characteristics discovery about next service.

      gattcDbDiscovery->currSrvInd++;
      gattcDbDiscovery->currCharInd = 0;
      characteristicsDiscover(pBleEvent, gattcDbDiscovery);

      return NRF_SUCCESS;
    }

  BLE_PRT2("descDiscover sHdl %d eHdl %d\n", handleRange.startHandle, handleRange.endHandle);
  ret = sd_ble_gattc_descriptors_discover(gattcDbDiscovery->dbDiscovery.connHandle, (ble_gattc_handle_range_t *)&handleRange);
  if (ret)
    {
      BLE_ERR("sd_ble_gattc_dd NG %d\n", ret);
      goto err;
    }
  return 0;
err:
  gattcDbDiscovery->discoveryInProgress = false;
  setDbDiscoveryEvent(pBleEvent, gattcDbDiscovery->dbDiscovery.connHandle,
    BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_DESCRIPTOR);
  return -1;
}

/****************************************************************************
 * For HAL I/F
 ****************************************************************************/

static int32_t set_adv_data(void)
{
#define BLE_TX_POWER_LEVEL  0
  int ret             = 0;
  int8_t tx_power         = BLE_TX_POWER_LEVEL;
  BLE_GapAdvData adv_data = {0};

  adv_data.flags = BLE_GAP_ADV_LE_GENERAL_DISC_MODE | BLE_GAP_ADV_BR_EDR_NOT_SUPPORTED;
  adv_data.txPower = tx_power;
  adv_data.complete32Uuid = 0;
  adv_data.completeLocalName.advData = (uint8_t*) bt_common_context.ble_name;
  adv_data.completeLocalName.advLength =
    strnlen((char*)adv_data.completeLocalName.advData, BUF_LEN_MAX);
  ret = BLE_GapSetAdvData(&adv_data);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("set ble adv data failed, ret=%d\n", ret);
    }

  return ret;
}

static int32_t init_pairing_mode(BLE_GAP_IO_CAP io_cap)
{
  BLE_GapPairingFeature* pf = &g_ble_context.pairing_feature;
  int ret                   = 0;
  BLE_GapOOB oob            = BLE_GAP_OOB_AUTH_DATA_NOT_PRESENT;
  BLE_GapAuth auth          = BLE_GAP_AUTH_REQ_NO_MITM_BOND;
  pf->oob                   = oob;
  pf->ioCap                 = io_cap;
  pf->authReq               = auth;
  pf->minKeySize            = BLE_GAP_MIN_KEY_SIZE;
  pf->maxKeySize            = BLE_GAP_MAX_KEY_SIZE;

  return ret;
}

 
static int ble_start(void)
{
  BLE_InitializeParams params       = {0};
  int ret                       = 0;

  ret = sem_init(&g_ble_context.ble_srv_sds.char_rw_buf_sem, 0, 1);
  if (ret)
    {
      LOG_OUT("service in semaphore init failed.\n");
      return ret;
    }

  params.role = BLE_ROLE_PERIPHERAL_AND_CENTRAL;

  ret = BLE_CommonInitializeStack(&params);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("ble stack init failed, ret=%d\n", ret);
    }

  return ((BLE_SUCCESS == ret) ? 0 : -1);
}

static int ble_stop(void)
{
  int ret = BLE_CommonFinalizeStack();
  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("ble stack fina failed, ret=%d\n", ret);
    }

  ret = sem_destroy(&g_ble_context.ble_srv_sds.char_rw_buf_sem);
  if (ret)
    {
      LOG_OUT("service in semaphore init failed.\n");
    }
  return ret;
}


/****************************************************************************
 * Name: nrf52_ble_scan
 *
 * Description:
 *   Bluetooth LE start/stop scan.
 *   Start/Stop scan.
 *
 ****************************************************************************/

static int nrf52_ble_scan(bool enable)
{
  int ret = BT_SUCCESS;
  if( true == enable)
    {
      ret = BLE_GapStartScan();
    }
  else
    {
      ret = BLE_GapStopScan();
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_ble_connect
 *
 * Description:
 *   Bluetooth LE connect to target device
 *
 ****************************************************************************/

static int nrf52_ble_connect(const BT_ADDR *addr)
{
  int ret = BT_SUCCESS;
  BLE_GapAddr gap_addr = {0};

  gap_addr.type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
  memcpy(gap_addr.addr, addr->address, sizeof(gap_addr.addr));

  ret = BLE_GapConnect(&gap_addr);

  return ret;
}

/****************************************************************************
 * Name: nrf52_ble_disconnect
 *
 * Description:
 *   Bluetooth LE disconnect link to target device
 *
 ****************************************************************************/

static int nrf52_ble_disconnect(const uint16_t conn_handle)
{
  int ret = BT_SUCCESS;
  BLE_GapConnHandle handle = conn_handle;

  ret = BLE_GapDisconnectLink(handle);

  return ret;
}

static int nrf52_ble_advertise(bool enable)
{
  int ret = 0;
  if (true == enable)
    {
    ret = set_adv_data();
    
      ret = BLE_GapStartAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble enable advertise failed, ret=%d\n", ret);
        }
    }
  else
    {
      ret = BLE_GapStopAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble disable advertise failed, ret=%d\n", ret);
        }
    }
  return ret;
}

static int nrf52_ble_set_dev_addr(BT_ADDR *addr)
{
  int ret;
  ble_gap_addr_t nrf52_addr;

