sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  nrf52_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
  memcpy(nrf52_addr.addr, addr->address, sizeof(nrf52_addr.addr));

  ret = sd_ble_gap_addr_set(&nrf52_addr);
  return bleConvertErrorCode(ret);
}

static int nrf52_ble_set_dev_name(char *name)
{
  int ret = BT_SUCCESS;
  size_t nameSize = 0;

  /* Get name length */

  nameSize = strlen(name);

  /* If invalid size, retrun NG */

  if (!name || nameSize > BT_MAX_NAME_LEN)
    {
      return -EINVAL;
    }

  /* Copy device name to local name */

  strncpy(bt_common_context.ble_name, name, nameSize);

  /* Send device name to chip */

  return ret;
}

static int nrf52_ble_set_appearance(BLE_APPEARANCE appearance)
{
  int ret = BT_SUCCESS;
  return ret;
}

static int nrf52_ble_set_ppcp(BLE_CONN_PARAMS ppcp)
{
  int ret = BT_SUCCESS;
  return ret;
}

static uint16_t nrf52_ble_set_mtusize(uint16_t sz)
{
  uint16_t ret;

  if (sz > NRF_SDH_BLE_GATT_MAX_MTU_SIZE)
    {
      ret = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
    }
  else
    {
      ret = sz;
    }

  commMem.requested_mtu = ret;
  return ret;
}

static uint16_t nrf52_ble_get_mtusize(void)
{
  return commMem.requested_mtu;
}

static int nrf52_ble_get_negotiated_mtusize(uint16_t handle)
{
  if (handle != g_ble_context.ble_conn_handle)
    {
      return -EINVAL;
    }

  return commMem.client_rx_mtu;
}

/****************************************************************************
 * Public Data
 ****************************************************************************/
BLE_Context g_ble_context;

/****************************************************************************
 * BT Dummy
 ****************************************************************************/


/****************************************************************************
 * Name: nrf52_bt_init
 *
 * Description:
 *   Bluetooth Initialize
 *   Prepare NV storage etc for non power item initialize.
 *
 ****************************************************************************/

static int nrf52_bt_init(void)
{
  int ret = BT_SUCCESS;

  ret = BLE_CommonSetBleEvtCallback((BLE_EfCb)NULL, &g_ble_context.ble_evt_ctx);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("set ble evt callback failed, ret=%d\n", ret);
    }
  init_pairing_mode(BLE_GAP_IO_CAP_NO_INPUT_NO_OUTPUT);
  return (BLE_SUCCESS == ret) ? 0 : -1;
}

/****************************************************************************
 * Name: nrf52_bt_finalize
 *
 * Description:
 *   Bluetooth Finalize
 *   Release NV etc.
 *
 ****************************************************************************/

static int nrf52_bt_finalize(void)
{
  int ret = BT_SUCCESS;

  ret = BSO_Finalize(NULL);
  if (ret)
    {
      ret = -ENXIO;
      BLE_PRT("BSO_Finalize failed\n");
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_bt_enable
 *
 * Description:
 *   Bluetooth Enable
 *   Turn ON/OFF bluetooth and operate UART and Receive thread.
 *
 ****************************************************************************/

static int nrf52_bt_enable(bool enable)
{
  int ret = BT_SUCCESS;

  if (enable == true)
    {
      ret = ble_start();
    }
  else
    {
      ret = ble_stop();
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_ble_common_register
 *
 * Description:
 *   Register BLE common HAL I/F
 *
 ****************************************************************************/

int nrf52_ble_common_register(void)
{
  return ble_common_register_hal(&ble_hal_common_ops);
}

/****************************************************************************
 * Name: nrf52_bt_common_register
 *
 * Description:
 *   Register BT common HAL I/F
 *
 ****************************************************************************/

int nrf52_bt_common_register(void)
{
  return bt_common_register_hal(&bt_hal_common_ops);
}

